---
kind: type
id: T:Autodesk.Revit.DB.UpdaterInfo
source: html/839e2681-fa26-6587-5a92-e8dcd88af852.htm
---
# Autodesk.Revit.DB.UpdaterInfo

Information of an updater, such as: Name, AdditionalInformation, name of the application that owns the updater, etc.

## Syntax (C#)
```csharp
public class UpdaterInfo : IDisposable
```